'use strict';

// 01.#########################################################################################

let a = 1, b = 1, c, d;
c = ++a;
alert(c);
/*
    вначале выполнится префикс-инкремент значения в переменной а. 
    a будет равно 2. Далее переменной с присваиваем значение переменной а. с будет равняться двум.
*/

d = b++;
alert(d);
/*
    вначале присваиваем переменно d значение переменной b. d=1. 
    затем постфикс инкремент переменной b увеличивает ее значение на единицу. b=2.
*/

c = 2 + ++a;
alert(c);
/*
    из пред.примеров выше значение переменной а = 2. Делаем префикс-инкремент, а = 3. Далее 2+3 получаем значение 5 в переменной с.
*/

d = 2 + b++;
alert(d);
/*
    из пред.примеров выше значение переменной b = 2. d = 2 + 2, получаем 4. Далее, значение переменной b увеличивается на ед. = 3.
*/

alert(a);
alert(b);
//значение каждой из пер. = 3.

// 02.#########################################################################################

a = 2;
let x = 1 + (a*=2);
console.log(a,x);
console.log(Boolean(null));
/*
    a*=2 тоже самое, что a = a*2.Пер. а присваиваем значение, получившееся путем умножения начального значения пер.а (строка 38) на 2.
    вначале делаем то, что в скобках получаем 4, х = 1+4, получаем 5.
*/

// 03.#########################################################################################

let Calc = (a,b) => {
    if (a>=0 && b>=0) {
        if (a>b) {
            return a-b;
        } else {
            return b-a;
        }
    } else if (a<0 && b<0) {
        return a*b
    } else {
        return a+b
    }
}

//let не исп, у нас выше они объявлены
a = -1, b = 3;
console.log(Calc(parseInt(a),parseInt(b)));

// 04.#########################################################################################

function plus(a,b) {
    return a+b;
}
function minus(a,b) {
    return a-b;
}
function div(a,b) {  
    return (b!=0 || b!=-0) ? a/b : null;    
}
function multi(a,b) {  
    return a*b;
}

// 05.#########################################################################################

function mathOperation(arg1,arg2,operation) {
    switch (operation) {
        case '+': return plus(arg1,arg2);
            break;
        case '-': return minus(arg1,arg2);
            break;
        case '/': return div(arg1,arg2);
            break;
        case '*': return multi(arg1,arg2);
            break;
        default: return;
    }
    return;
}
console.log(mathOperation(2,0,'/'));

// 06.#########################################################################################

function six() {
    let suffix="";
    let d = prompt("Р? >").trim();
    const OK = /\d+/gm.test(d);
    if (!OK) return;
    d=d.toString();
    switch (d[d.length-1]) {
        case "1": suffix = "рубль";
            break;
        case "2": 
        case "3":
        case "4": suffix = "рубля";
            break;
        default: suffix = "рублей";
    }
    
    return `Ваша сумма в ${d} ${suffix} успешно зачислена.`;
}
alert(six());